{
  "articles": {
    "title": "Articles",
    "showcaseArticle": {
      "title": "Vacanza 101: How to travel without paying for accommodation",
      "description": "Vacanza is the first greek platform that brings to Greece exclusively the home exchange model. It has been proved to be very successful in other countries of Europe mainly for traveling without paying for accommodation, but also for forming bonds with new people.\nIt is an alternative to the ordinary booking sites in which you pay your money for accommodation, and you don't know the other person and the current situation of the house before traveling.\nAlso, the host does not know what kind of person you are, and many times cannot cancel your booking without a penalty. This can leave both the hosts and guests dissatisfied and potential damages to the property,\n\nVacanza on the contrary is based on open communication and choosing a travel partner that is compatible with your needs and priorities, without paying your money for accommodation.\nAll our users and properties undergo a verification process with regular checks, in order to keep the community safe.\nIf you want maximum safety, you can also follow our safety guidelines \"HERE\" (link of the safety guidelines article).\n\nOne of the most important things of Vacanza is that YOU decide when to make your house available (through the availability calendar), and you decide who to accept in your house, after having communicated with them. If you are compatible you can proceed to exchange and enjoy your free vacation!\n\nVacanza can be beneficial for:\nHomeowners who want to go on vacation without paying for accommodation.\nHomeowners who want to travel with a different experience.\nHomeowners with unused houses.\nTenants, who already pay rent and do not want to pay (or cannot pay) big sums of money to go on vacation. In this case tenants should check with their homeowner that it can be allowed.\nHomeowners who have an investment house on traditional booking sites - making the house available only when they want to go on vacation, then put it back for profit later.\nFamilies - who have different needs from other people, and can find other families on the platform to exchange.\nDigital nomads searching for a house in Greece, without having to deal with agencies and extra costs.\nSolo travelers, Couples, Single women, Retirees - Each of you have different priorities and needs, and through the platform you can find compatible people that have the same priorities and needs as you.\n\nAs it is also in other countries, Vacanza offers the opportunity to make simultaneous exchanges (exchange houses at the same time), or non-simultaneous exchanges (for example, Maria goes to Giorgos house now, and Giorgos will go to Maria next month).\nThis allows for the maximum flexibility between the two people's schedules.\n\nAlso, at Vacanza we are constantly working with other companies, including car rental companies, insurances, flight companies and more, in order to give you the most affordable way of traveling beyond accommodation as well.\n\nThis model will allow also to keep a more sustainable economy and environment, and a sense of community, giving value also to small centers in Greece and discovering places that you didn’t know existed.\n\nIf you are ready to join Vacanza, you can select your favourite plan below:\n\"BASIC\"\n\"PREMIUM\""
    },
    "firstArticle": {
      "title": "How Vacanza is the most affordable way to travel:",
      "description": "Vacanza has brought to Greece a unique way of traveling, that allows you not to pay for accommodation and be more respectful about the local economy and environment.\n\nThe main expenses for vacation are usually: transport and accommodation.\nWith Vacanza you can take the accommodation costs to zero, exchanging unlimited times for free during your subscription, and also reducing your transport costs. In fact, we collaborate with car rental companies, flight and ferry companies, in order to always give our customers the best prices possible.\nYou can find these discounts in your personal area.\n\nKeeping it more affordable could also mean that you can go on vacation multiple times!\nThe costs will not be a problem anymore. It will just be about the “when”.\n\nAlso, not only Vacanza is way more affordable than traditional sites for vacation, but it is also more sustainable for the local environment and local economy, having no interests in profiting or speculation, thus not inflating the prices in the real estate market.\n\nIn order to keep everything working and functional, we just ask you for a small annual fee to cover our monthly costs and to keep more and more people working with us.\n\nHave a good Vacanza!\nCTAs"
    },
    "secondArticle": {
      "title": "How you can ensure the safest exchange (Safety guidelines):",
      "description": "Your vacation should be the safest possible, in order for you to enjoy it, relax and have fun. In this article you will find the guidelines to ensure the safest vacation you can experience.\n\nSome of our users regularly make 10, 20, 50 exchanges a year, but we know the first time you think of leaving your house to someone can be daunting. That’s why we are here to provide you with all the information you need for the maximum safety.\n\nThe basics of the system is user verification: the ones that have fully verified profiles are assigned with the “verified” badge and are easily recognizable.\n\nAlso, each user and property have public reviews, in order to add an extra layer of safety. Above a certain number of reviews and exchanges, users will also get the “Golden Host” and “Golden Guest” badges, showing that they have had a great amount of experience and safe exchanges.\n\nOther practical guidelines for safety are:\n- Taking photos before and after\n- Don’t leave precious objects inside the house\n- Always talk via chat to have everything written and recorded\n- If you meet in person or do video calls with each other, always recap in written form later.\n- Establish the rules of the house beforehand and keep them written (for a complete guide of exchange etiquette read HERE).\n- Signal users who have fraudulent or strange behaviour (asking for money to exchange, being threatening, not being clear on important aspects). We will do checks on them. People who are considered a harm to others have no place in the platform and will be permanently banned.\nLastly, to add even more safety, we collaborate with insurance companies in order to give you the best product possible tailored to your needs, and cover for possible damages, theft and more. This has a separate cost, and is not mandatory, but you can do it if you want to be 100% safe and sound.\n\nHave a good Vacanza!\nCTAs"
    },
    "thirdArticle": {
      "title": "The 3 types of exchange:",
      "description": "Discover all the types of exchanging available in Vacanza and choose the one you prefer.\nYou can also choose multiple ones of course, based on your needs at the moment.\n\nStarting with number one, the classic exchange is the simultaneous exchange: I come to your house in Crete, you come to my house in Athens. We both enjoy our stay, make new friends, make new experiences, and return to our home full of joy and satisfaction (and with some extra euros saved).\nWe also keep in touch, in case I want to come back to Crete again in the future.\n\nThe second type of exchange is the non-simultaneous: you can come to Athens now\n(I am on a business trip at the moment..), and I will come to Crete in another moment, when you make your house available for me.\n\nAnother type of exchange is co-living: you can come to my house while I am also inside (you have an exam tomorrow and I have a spare room for you). Don’t worry, I am busy working and I guess you’re busy working or studying too, or seeing places around. We could also go out together if you want sometimes.\n\nFinally, there can also be a “non reciprocal” exchange, meaning that only one person goes to the partner’s house without exchanging their own house.\nSince it doesn’t involve an exchange we just mention it for the sake of possibilities.\nThis type can be useful if you have pets for example: you can bring a “pet sitter” to take care of your pets, cost-free, and they can stay in your house cost-free for the period of time that you agree.\n\nFeel free to communicate with your partner and choose whatever type of exchange suits you both the most.\n\nHave a good Vacanza!"
    },
    "fourthArticle": {
      "title": "How to create attractive listings: (RESERVED TO MEMBERS)",
      "description": "In order to maximize your success and numbers in exchanging your properties, you need to build the maximum trust with the people who view your profile and your properties.\nFor your profile, just follow the verification procedure until you reach 100% completion.\nFor your properties, below you will find the best practices to maximize your number of requests.\n\nGuidelines to maximize the attractiveness of your listing include:\n- Photos that are at least good quality, showing the spaces in a functional and aesthetic manner without unnecessary clutter. Make people imagine to “enter the photo” and be there.\n- Complete and detailed description of the property. Include: amenities, rules of the house, eventual problems that they may encounter. People will appreciate transparency and clarity.\n- Highlight the best features of the property both in photos and in the description.\n- Highlight the location of the property. What are the positive aspects? How well is it connected with transportation and key points? (airport, port, train stations, public transports, sea or mountains, touristic sites, museums). Clear indications for which transportation (in minutes) are considered a plus.\n- Highlight local services and their distance from the property (supermarkets, minimarkets, pharmacies, banks etc).\n- Describe briefly the neighborhood in the description. Is it safe? Is it quiet? Central?\n- Highlight relevant activities in the area if there are any. Some people do not only look for relaxation but also for activities. Some examples are: horse riding, hiking paths, surfing clubs, sailing, skiing, natural and thermal springs, cultural experiences etc. The same can be done with famous local events, local food and your favourite places to visit.\n- Be specific about pets and children: can your house welcome them or not?\n- Avoid hiding things. On the contrary, people will be frustrated and disappointed if you omit important details, leaving room for bad reviews and no second exchanges with the same person.\n\nThese guidelines are nothing without the proper communication though. Communicate always in a friendly, transparent and polite manner.\n\nHave a good Vacanza!"
    },
    "fifthArticle": {
      "title": "Etiquette: (RESERVED TO MEMBERS)",
      "description": "Exchanging houses is fun and cost-free, but it is mandatory to respect each other's rules, establishing them beforehand.\n\nWe encourage you to be respectful and polite of each other’s needs, in order to ensure the best vacation possible for all the people involved.\nWe also remind you that it is prohibited to ask for money for the exchange. In case this happens, kindly report it to us.\n\nSome guidelines for best practices involve:\n\n- Friendly behaviour, respect, politeness\n- Be honest and transparent about your property (location, amenities etc)\n- Avoid copy paste and personalize your messages\n- Remove all the personal items in the house (e.g. family photos) in order to make the guest feel more welcomed and not like an “intruder” in your house\n- Communicate about what objects to bring eventually, and what is already in the house (e.g. you want to bring your own bedsheets, towels, kitchen utensils etc. or not?)\n- Put in writing the basics (password of the WIFI, how to use kitchen and bathroom appliances etc.).\n- Communicate about where to leave the keys (e.g. inside the house if you have a backup key; to a local shop that you trust: to a friend; to a local online service etc.- Or you can exchange them in person if you want).\n- Want to save the cost of car rental as well? You can also exchange your cars if you want to.\n- Be clear about the rules in the beginning, but don’t be constantly pressing during the stay. Enjoy and let the other person enjoy the stay\n- Be available in case the other person needs suggestion about the place (where to eat, what to do at night, which museums to visit etc)\n- In case something breaks, report it immediately and communicate on the solution, based on the urgency. You can always get tailored insurance if you want to be fully covered.\n- In case something very serious happens and you must cancel the exchange, let your partner know in time, or if it’s too last minute, try to find an alternative accommodation for them.\n- When you leave the house, leave it in pristine and clean condition as it was yours. You can also make professional cleaners come if you don’t want to clean yourself, if the host agrees.\n- It’s always nice to make gifts to the other person to thank them for the hospitality, if you want.\n- After the exchange, you can stay in touch with your new friends, and organize another exchange with them if you want to!\n\nFollowing these simple guidelines, you will ensure the best vacation for yourself and for your family.\n\nTo ensure the maximum safety of your exchange and fully enjoy your stay, you can also read all the safety guidelines \"HERE\"\n\nHave a good Vacanza!"
    },
    "sixthArticle": {
      "title": "Tenants and students can go on vacation without wasting their precious savings?",
      "description": "If you are a tenant, you know that rent price and bills are a pain. Why should you pay more also for your holidays?\nVacanza gives you the opportunity to connect to people like you that want to exchange their house for a vacation. You just have to communicate with each other, agree on the dates, set the rules and enjoy the experience.\n\nAll the exchanges are unlimited and cost-free during the subscription period, and also service fees to finalize exchanges are 0.\n\nPlease note: tenants must seek approval from the homeowner before committing.\n\nRead some of our customers' feedback here!\n\nFEEDBACKS OF TENANTS AND STUDENTS\n\nHave a good Vacanza!"
    },
    "seventhArticle": {
      "title": "How Vacanza is the best option for holidays for families with kids",
      "description": "Families have different needs and worries from other types of travelers.\nThat’s why many times “traditional” paid platforms don't work out for them: too many costs, and too little communication - with a host that probably doesn’t even care.\n\nWith Vacanza, families have 2 fundamental advantages:\n1: It is completely cost-free to exchange during the subscription period. That brings their cost for finding accommodation to 0. And also, service fees for exchanges are 0.\n2: Families can find other families on the platform that have their exact same needs and worries, and communicate with them before exchanging to make sure everything is in order. Think like you are making new friends that have a house you can go on vacation to.\n\nTo ensure the maximum safety we suggest reading \"HERE\" for all the safety guidelines.\nTravelling economically and safely you can make your kids explore this beautiful country!\n\nRead also here below some feedbacks:\n\nFEEDBACKS OF FAMILIES (regarding children, safety etc)\n\nHave a good Vacanza!"
    },
    "eighthArticle": {
      "title": "Digital nomads and expats in search of house in Greece",
      "description": "If you work online and are free to move wherever you want, you will still have to commit to search for houses, pay agency commissions, undergo slow and painful bureaucracy, negotiations and contracts etc if you use traditional sites and channels.\n\nInstead, you can connect to local people that have the same desire to travel as you, faster and without paying extra costs.\n\nRead our customers feedbacks below:\n\nDIGITAL NOMADS FEEDBACKS (problems with traditional real estate agencies, maximum flexibility with Vacanza)\n\nHave a good Vacanza!"
    },
    "ninthArticle": {
      "title": "How Vacanza can be the safest option for women travelling solo",
      "description": "On Vacanza you can find like-minded women and people that have the same needs and priorities as you do, and communicate with them freely.\n\nWe suggest you follow the safety guidelines HERE, in order to ensure the maximum safety for your vacations.\n\nRemember also, that you can accept an exchange or a conversation only if you want to. In this way you have complete freedom to choose who to exchange with, and you may even make friends in the meanwhile!\n\nRead our customers feedbacks below:\n\nWOMEN FEEDBACKS (address safety, flexibility to choose)\n\nHave a good Vacanza!"
    },
    "tenthArticle": {
      "title": "Vacanza for retirees",
      "description": "Whether you are alone, in a couple or with friends. Whether you search for relaxation, fun activities or something different from the traditional way of traveling, short or long stays, Vacanza has it for you.\n\nFind like-minded people, and read our customers feedbacks below:\n\nRETIREES FEEDBACKS\n\nHave a good Vacanza!"
    },
    "eleventhArticle": {
      "title": "Why Vacanza is the future of sustainable travel",
      "description": "A rising importance nowadays should be given to the topic of sustainability of the local economy and environment, and to eco-friendly solutions.\n\nFirstly, Vacanza aligns with eco-conscious travel habits, reduces carbon footprint, and has way less resource use compared to hotels and hospitality structures.\n\nAlso, a special focus is given to small local communities, supporting slow travel and deep cultural experiences, allowing you to discover new things about this country.\nYou probably have noticed that the properties that you find on traditional sites are also somewhat uniform and follow a precise trend and aesthetic, not aligning with local communities and culture. With Vacanza you don't have to appeal to a specific market, nor stress about strategies to maximize the revenue.\n\nLastly, being a non-speculative way of travel it has a minimal impact on the local housing market, compared with short term rentals (e.g. BnB) that have vastly populated the centers making the prices of houses skyrocket. This situation created a ban in the historical center of Athens in 2025, where it is not possible to create other BnBs, in an attempt to stop the rising inflation (the rise in prices of housing and goods).\n\nIn conclusion, not only Vacanza offers a more eco-friendly approach to traveling, but also can help the people that live in Greece find houses to rent or buy in the long term, potentially slowing down the inflation and the rise in prices.\n\nReady to join?\nCheck our plans HERE"
    },
    "twelfthArticle": {
      "title": "How Bonus Programs work",
      "description": "Bonus Programs are an essential part of the platform!\nSince this is a community-based platform, it is important to invite as many people as you can and let them know this way of traveling for its cost-effectiveness, safety and sustainability.\nThe more people our users invite on the platform, the more properties there will be on it, and this means more choice for everybody.\n\nWe aim to create a platform that makes traveling easy and affordable for everyone, no matter if you are a student, a retiree or a 12 hour working person. Everyone should find on Vacanza their perfect travel choice without spending a fortune, while also making new connections and friends.\nYou want to go on vacation? You have lots of options to choose from and you don’t have to think about money for accommodation!\n\nWe obviously made sure to reward you for your time promoting the platform, with discounts, special badges and even surprise vacations!\n\nSpecifically these programs are currently active: BONUS PROGRAMS\n\nHave a good Vacanza!"
    },
    "thirteenthArticle": {
      "title": "Have fun with Badges!",
      "description": "Badges are a fun way to keep track of your travels and show other people that you are experienced with the platform. This will likely boost the initial trust of users and consequently increase your requests.\nYou can unlock badges by performing specific actions with your exchanges. They are divided into categories such as seasonal (do you travel mostly during summer or winter?), region-based (how many times you traveled to Peloponnese?), exchange experience and other categories.\n\nBelow you find the complete list of badges:\n\nCOPY BADGES SECTION HERE\n\nHave a good Vacanza!"
    },
    "fourteenthArticle": {
      "title": "Make new friends with Vacanza",
      "description": "While traveling or working, you can make friends in different places and establish new connections!\nSometimes, being in a foreign place where you don’t know local people can be lonely.\nThat’s what Vacanza is also for.\n\nBecause there's another, deeper reward that many don’t expect until they experience it firsthand: the friendships and human connections that naturally grow from sharing homes and lives—even for a short time.\nThe Greek Spirit of Filoxenia: More Than Just Hospitality\nIn Greece, hospitality isn’t just a nicety—it’s a way of life. The ancient concept of filoxenia translates to “friend to a stranger,” and it's still deeply woven into the culture today. When you exchange homes with someone in Greece, you’re not just borrowing a space—you’re stepping into a story, a neighborhood, and often, into someone’s community.\nWhether you're swapping homes in Athens, a seaside village in the Peloponnese, or a tucked-away island like Naxos, you're entering a world where connections matter. You might be greeted with fresh fruit from a neighbor’s garden, or receive insider tips on the best local taverna. Many exchangers find that these moments lead to real friendships that last long after the trip ends.\nHome Exchange: A Natural Bridge Between People\nUnlike hotels or short-term rentals, home exchanges invite trust, communication, and mutual respect from the very beginning. It starts with messaging, sharing family details, and perhaps even a video call. You’re not just booking a place—you’re building a relationship.\nThese bonds often extend beyond the initial exchange:\n- Families stay in touch and plan future swaps.\n- Guests become pen pals, sharing recipes or photos.\n- Hosts introduce visitors to friends or family in the area.\n- Some exchangers even meet in person to hand over keys or welcome one another.\nIt’s not uncommon for a simple exchange to evolve into a global friendship network—a modern twist on an ancient Greek value.\nThe Real Perks of Human Connection\nWhile travel offers sights and experiences, connections offer meaning. When you make friends through a home exchange, the benefits go far beyond accommodation:\n- Authentic travel: Friends guide you to experiences off the tourist path.\n- Cultural learning: Conversations over coffee often teach more than a guidebook ever could.\n- A sense of belonging: Being invited to a name-day celebration or a beach picnic can turn a trip into a memory you’ll cherish forever.\n- Travel support: Whether it's getting help with a ferry ticket or borrowing beach gear, having local allies makes travel smoother and more relaxed.\nA Travel Community, Not Just a Platform\nAt its best, a home exchange site isn’t just a booking platform—it’s a community of like-minded travelers who value trust, friendship, and meaningful experiences. In Greece, where every corner is steeped in history, beauty, and warmth, this community thrives.\nIf you’re considering a home exchange in Greece, go in with an open heart. The greatest gift you might take home isn’t a ceramic dish or bottle of olive oil—but a friendship that spans borders.\nReady to make your next adventure more personal, more authentic, and more connected? Join our home exchange community—and discover the joy of traveling not just to places, but to people.\nExplore our Plans HERE"
    }
  }
}
