{
  "terms": {
    "content": "TERMS OF SERVICE\nEffective Date: [Insert Date]\nCompany Name: [Your Cyprus Company Name]\nCompany Address: [Registered Office in Cyprus]\nEmail: [Support Email]\nThese Terms of Service (\"Terms\") govern your use of our home exchange platform (\"Platform\"), operated by [Your Company], a company registered in the Republic of Cyprus. By using the Platform, you agree to these Terms.\n\n1. Overview\nOur Platform allows users to exchange homes on a non-monetary basis for vacation or temporary stays. We are not a real estate agency or broker. We provide tools to find properties via a map interface, communicate with other users via in-app messaging, and manage your listings.\n2. Eligibility\nYou must be 18 years or older to use the Platform. By registering, you confirm that:\nYou have the legal right to offer the property listed (ownership or permission).\nYou are solely responsible for ensuring the exchange is lawful under local rules.\n3. Subscription and Fees\nA standard annual subscription fee is charged to access the full Platform.\nYou may choose an optional visibility boost to feature your property in search results for an additional fee.\nAll fees are clearly displayed before payment. No hidden charges.\nSubscription fees are non-refundable unless otherwise required by law.\n4. Nature of Exchange\nExchanges are non-commercial and based on mutual agreement between users.\nWe are not responsible for ensuring that an exchange is completed.\nUsers negotiate and agree independently; we do not verify the content or suitability of properties.\n5. User Conduct\nYou agree to:\nProvide accurate information and photographs\nKeep your availability calendar up-to-date\nCommunicate respectfully with other users\nAvoid discriminatory or unlawful conduct\nYou may not:\nOffer properties you don’t have rights to\nUse the Platform for any paid rentals\nCircumvent fees or attempt to transact off-platform\n6. In-App Messaging\nThe Platform includes secure in-app messaging. Users must use this system for communication related to exchanges. Misuse of messaging may result in account suspension.\n7. Search and Listings\nThe map-based search function is provided as-is. Featured listings are based on location, relevance, and any applied visibility boosts.\n8. Liability and Disclaimers\nWe do not inspect or endorse any property.\nWe are not liable for damages, loss, or disputes resulting from exchanges. If you are concerned about this matter check insurance packages.\nUse the Platform at your own risk.\nUsers are encouraged to confirm insurance coverage for guests.\n9. Termination\nWe may suspend or terminate your access for violations of these Terms or legal requirements. You may close your account at any time.\n10. Privacy\nYour personal data is handled under our [Privacy Policy]. We comply with the EU General Data Protection Regulation (GDPR).\n11. Governing Law and Jurisdiction\nThese Terms are governed by the laws of Cyprus. Any dispute arising shall be subject to the exclusive jurisdiction of the Cypriot courts.\n\nBy registering or using the Platform, you confirm your agreement to these Terms."
  },
  "privacy": {
    "content": "Effective Date: [Insert Date]\nCompany Name: [Your Cyprus Company Name]\nCompany Address: [Your Registered Address in Cyprus]\nContact Email: [Support Email or DPO Email]\nThis Privacy Policy explains how [Your Company] collects, uses, and protects your personal data when you use our home exchange platform (the \"Platform\"). We are committed to protecting your privacy in accordance with the EU General Data Protection Regulation (GDPR).\n\n1. Data Controller\nThe data controller is [Your Company], a company registered in Cyprus. You may contact us at the email provided above.\n2. What Data We Collect\nWe may collect the following types of data:\nAccount Information: Name, email, password (hashed), preferred language\nProfile and Property Data: Property description, photos, address (approximate location for map), availability calendar\nUsage Data: IP address, browser type, device information, usage logs\nMessages: Contents of in-app communications between users\nPayment Information: Processed securely by third-party payment processors; we do not store credit card numbers\n3. How We Use Your Data\nWe use your data to:\nCreate and manage your account\nDisplay listings and facilitate exchanges\nProvide customer support\nImprove and secure our Platform\nComply with legal obligations\n4. Legal Basis for Processing\nWe rely on the following legal bases:\nYour consent (e.g., for marketing emails)\nPerformance of a contract (e.g., fulfilling your subscription)\nLegal obligation (e.g., accounting records)\nLegitimate interests (e.g., preventing fraud, improving services)\n5. Sharing Your Data\nWe do not sell your data. We share your data with:\nHosting providers (EU-based)\nPayment processors (GDPR-compliant)\nEmail services (e.g., transactional messages)\nLegal authorities when required\nAll third parties are bound by confidentiality and data processing agreements.\n6. International Data Transfers\nYour data is stored in the EU. If transferred outside the EU, we ensure appropriate safeguards (e.g., Standard Contractual Clauses).\n7. Data Retention\nWe retain your data as long as your account is active and for legal or operational reasons thereafter. You can delete your account at any time.\n8. Your Rights\nUnder GDPR, you have the right to:\nAccess your personal data\nCorrect or update data\nRequest erasure\nRestrict or object to processing\nData portability\nWithdraw consent at any time\nTo exercise your rights, contact us at [Contact Email].\n9. Cookies and Tracking\nWe use cookies for:\nLogin and session management\nSite performance analytics\nImproving user experience\nYou can manage cookie preferences through our cookie banner or browser settings.\n10. Changes to This Policy\nWe may update this policy from time to time. We will notify users of significant changes.\n\nIf you have concerns about how we process your data, you have the right to lodge a complaint with the Cyprus Commissioner for Personal Data Protection or your local data authority."
  },
  "cookies": {
    "content": "COOKIE POLICY\nEffective Date: [Insert Date]\nCompany Name: [Your Cyprus Company Name]\n\nThis Cookie Policy explains how our home exchange platform (\"Platform\") uses cookies and similar technologies to provide, personalize, and improve your experience.\n\n1. What Are Cookies?\nCookies are small text files placed on your device to help websites function effectively and collect information about your visit.\n\n2. Types of Cookies We Use\n- Essential Cookies: Required for core functionality (e.g., login, language preferences).\n- Performance Cookies: Help us understand how visitors interact with the site (e.g., Google Analytics).\n- Functionality Cookies: Remember preferences and enhance usability.\n- Advertising Cookies (Optional): Used to display relevant advertising (only with your consent).\n\n3. How to Control Cookies\nWhen you visit our Platform, you are given the option to accept or reject non-essential cookies through our cookie banner.\n\nYou can also control cookies through your browser settings. Disabling some cookies may impact the functionality of the Platform.\n\n4. Third-Party Cookies\nWe may allow trusted third-party services (e.g., analytics providers) to place cookies. These providers have their own privacy and cookie policies.\n\n5. Updates to This Policy\nWe may update this Cookie Policy. Significant changes will be notified on our website.\n\nIf you have questions about this Cookie Policy, please contact us at [Support Email]."
  }
}
